using System;
using System.Collections.Generic;
using System.ComponentModel.DataAnnotations;
using System.Reflection.Metadata;
using System.Text.RegularExpressions;

namespace Function_3
{
    // Напишите ф-цию, которая должна проверить правильность ввода адреса эл. почты.

    // Почта верна при условии:

    // a.весь адрес не должен содержать русские буквы и спецсимволы, 
    // кроме одной «собачки», знака подчеркивания, дефиса и точки
    // причем они не могут быть первыми и последними в адресе, и идти подряд
    // например: «..», «@.», «.@» или
    // «@@», «_@», «@-», «--» и т.п.

    // b.имя эл.почты (до знака @) должно быть длиной более 2 символов, причем имя
    // может содержать только буквы, цифры, но не быть первыми и единственными в
    // имени, и точку;

    // c.после последней точки и после @, домен верхнего уровня(ru, by, com и т.п.) не
    // может быть длиной менее 2 и более 11 символов.
    class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
